Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/prod-ue2-sharedservices.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-sharedservices.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_iam_role_policy.step_functions_policy will be created
+ resource "aws_iam_role_policy" "step_functions_policy" {
      + id          = (known after apply)
      + name        = "anime_step_functions_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss",
                          + "arn:aws:lambda:us-east-2:481665084477:function:process_content",
                          + "arn:aws:lambda:us-east-2:481665084477:function:store_data",
                          + "arn:aws:lambda:us-east-2:481665084477:function:render_video",
                          + "arn:aws:lambda:us-east-2:481665084477:function:notify_post",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "anime_step_functions_role"
    }

  # aws_lambda_function.render_video will be updated in-place
~ resource "aws_lambda_function" "render_video" {
      ~ filename                       = "./artifacts/scripts/AnimeUtopia/render_video/render_video.zip" -> "./artifacts/scripts/render_video/render_video.zip"
        id                             = "render_video"
      ~ last_modified                  = "2025-03-10T22:49:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "+5VsTOi803MBbSewhTmIwTDBpJmuSF7Oasp3X2LHqt8=" -> "328NAEf5E5Va1gWpwLxvgt4xJYteiLBqCwnj8SpDyM4="
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.store_data will be updated in-place
~ resource "aws_lambda_function" "store_data" {
      ~ filename                       = "./artifacts/scripts/AnimeUtopia/store_data/store_data.zip" -> "./artifacts/scripts/store_data/store_data.zip"
        id                             = "store_data"
      ~ last_modified                  = "2025-03-10T22:49:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVx/rrjqXo5vhKJe8eU54S36MD4FdyrKID3POCDiua4=" -> "xbFSeoIoi8FEdK9TKvtCnYv8tSTzQh3azQ0/0Y+gcH4="
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_sfn_state_machine.anime_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "anime_workflow" {
      ~ definition                = jsonencode(
          ~ {
              ~ Comment = "State machine for automating anime post workflow" -> "State machine for automating anime post workflow with MoviePy"
              ~ States  = {
                  ~ CheckPost      = {
                      ~ Choices = [
                          ~ {
                              ~ Next         = "StartEC2" -> "ProcessContent"
                                # (2 unchanged attributes hidden)
                            },
                        ]
                        # (2 unchanged attributes hidden)
                    }
                  ~ RenderVideo    = {
                      ~ Next       = "SaveVideo" -> "NotifyUser"
                        # (3 unchanged attributes hidden)
                    }
                  - SaveVideo      = {
                      - Next       = "StopEC2"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:save_video"
                      - ResultPath = "$.saveVideoResult"
                      - Type       = "Task"
                    }
                  - StartEC2       = {
                      - Next       = "ProcessContent"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:start_instance"
                      - ResultPath = "$.ec2StartResult"
                      - Type       = "Task"
                    }
                  - StopEC2        = {
                      - Next       = "NotifyUser"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:stop_instance"
                      - ResultPath = "$.ec2StopResult"
                      - Type       = "Task"
                    }
                    # (5 unchanged attributes hidden)
                }
                # (1 unchanged attribute hidden)
            }
        )
        id                        = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow"
        name                      = "anime_workflow"
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedMatrix%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 1 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```